result_probably_consolidated/2core_4iothread/c8220(ivy)_consolidated_2core_8iothread/multiplier_16/run9.txt
# run=9/10
# 2026-04-07T23:11:31-06:00
# cmd: taskset -c 1-39 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            17766
        write:                           4607
        other:                           2369
        total:                           24742
    transactions:                        1100   (17.77 per sec.)
    queries:                             24742  (399.77 per sec.)
    ignored errors:                      169    (2.73 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      17.7733
    time elapsed:                        61.8907s
    total number of events:              1100

Latency (ms):
         min:                                   53.95
         avg:                                 1773.58
         max:                                 6176.27
         95th percentile:                     3639.94
         sum:                              1950939.15

Threads fairness:
    events (avg/stddev):           34.3750/2.92
    execution time (avg/stddev):   60.9668/0.56